## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.kv-audit-logs will be created
  + resource "azurerm_key_vault" "kv-audit-logs" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-aztf-log-prod-ne-02"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = false
      + resource_group_name             = "rg-aztf-logging-prod-ne-01"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tenant_id                       = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "84.10.55.110/32",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>